# CallToolByName

## Description
Similar to CallTool, but takes name rather than ID. Supports plug-in tools (but not yet internal tools).

```pascal
FUNCTION CallToolByName(toolName : STRING) : BOOLEAN;
```

```python

def vs.CallToolByName(toolName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|toolName|STRING||

## Version
Availability: from Vectorworks 2014
## Category
* Utility